# THIS FILE IS AUTOMATICALLY GENERATED
# Project: F:\demoNixie\demoNixie\DemoNixieV2.cydsn\DemoNixieV2.cyprj
# Date: Thu, 25 Jun 2020 21:28:34 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {ClockWait} -source [get_pins {ClockBlock/periclk}] -edges {1 500001 1000001} [list [get_pins {ClockBlock/ff_div_11}]]
create_generated_clock -name {DBG_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 435 869} [list [get_pins {ClockBlock/ff_div_5}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/periclk}] -edges {1 101 201} [list [get_pins {ClockBlock/ff_div_16}]]
create_generated_clock -name {ClockLedDriver} -source [get_pins {ClockBlock/periclk}] -edges {1 51 101} [list [get_pins {ClockBlock/ff_div_18}]]
create_clock -name {CyPeriClk_App} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for F:\demoNixie\demoNixie\DemoNixieV2.cydsn\TopDesign\TopDesign.cysch
# Project: F:\demoNixie\demoNixie\DemoNixieV2.cydsn\DemoNixieV2.cyprj
# Date: Thu, 25 Jun 2020 21:28:18 GMT
